---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Structure.ReinforcementSettings
source: html/b640c189-ade8-22fc-6ca0-40ff2f9a327d.htm
---
# ReinforcementSettings Members

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.